[
    {
        "title": "Update: AITAH for telling a woman at the gym that she's embarrassing herself?",
        "content": "Summary of previous post (skip this paragraph if you read that post): A woman at my gym, Andrea (fake name) asked me out after some normal not at all romantic interactions. I turned her down and shortly after I stated getting a weird vibe from her and started avoiding her. She confronted me about avoiding her twice, and the second time I said she was embarrassing herself, after which she put her foot on the weight stack of the machine I was using, causing me to let go of the bar really quickly and slam the weights. I initially thought I was the asshole for my rude comment, and most posters said I actually under reacted and should talk to gym management, which I did, after which Andrea confronted me again and asked me out again. I turned her down, we argued briefly and she said I needed to grow up.\n\nActual Update: Andrea is banned from the gym! I was running on the treadmill and watching TV. She came up to talk to me, and I ignored her, staring at the TV. She raised her voice and I continued to ignore her. She reached out and pulled the safety tab out of the treadmill (the one you connect to your wrist so the treadmill stops if you fall), causing the treadmill to come to a sudden stop. I tripped and fell onto the controls and TV, scratching my chin on the top of the screen.\n\nI went to the front desk with Andrea following me. I told them what she did. She kept trying to interrupt me and talk over me, but the woman at the front desk told her to be quiet and wait her turn. I told her Andrea pulled out the safety tab while I was running and injured me. The woman at the front desk then asked Andrea what happened. Andrea said I was \"staring into the middle distance\" like I was in some kind of \"fuage state\" and she thought I was having a medical episode so she pulled the tab.\n\nThe woman at the front desk asked for her membership card. Andrea didn't want to give it to her, but the woman at the front desk said if she didn't she would ban her. Andrea gave her the card and the woman at the front desk said to leave and she was suspended for a month. Andrea objected and got into an argument with the woman at the front desk that escalated into Andrea calling the woman an N word B word. So she was banned permanently.\n\nI hesitate to call that a happy ending because the poor gym employee had to put up with racial harassment, but I won't deny getting to watch her cut up Andrea's membership card felt good."
    }
]