[
    {
        "title": "TIFU by leaving out my “Kong” while I was at work.",
        "content": "I just got home and I genuinely don’t know how to process what just happened. Currently debating if I should move to the mountain by myself. \n\nSo here’s what just happened:\n\nMy wife’s out of town for the week and since I’ve been working crazy hours (an overnight shift straight into a morning one). I asked my mom to stop by the house, let the dog out, feed him, and keep him company until I could get myself home.\n\nNow here’s where it gets mortifying.\n\nWhen my wife is away for extended periods, I have a personal “toy” it’s blue, hourglass shaped and let’s say ergonomically designed. My wife is fully aware and even jokingly nicknamed it my Kong.\n\nAnyway, before I went to bed after my last shift, I washed it and left it on the dish rack in the kitchen. Usually I put it away immediately, but I guess I was overworked and I passed out without thinking twice.\n\nSo fast forward to today. I come home after 16 hours of nonstop work. I’m exhausted, dead on my feet, and just ready to fall into bed. I walk in and there’s my mom on the couch, happily playing with the dog.\n\nAnd in his mouth?\n\nThe KONG \n\nCovered.\n\nIn peanut butter.\n\nI freeze. Just completely short circuit. She gets up to greet me and goes, “He just LOVES his Kong!” Immediately she can tell something up and asked “Is everything ok sweetie?” I mumbled something like, “Yeah just a long day,” and stumbled off before I could burst into flames on the spot.\n\nShe didn’t stay long, thank God just left me a plate of food and went home. As soon as the door closed, I sprinted around the house trying to catch my dog, finally wrestled the “Kong” from him and chucked it in the trash like it was radioactive.\n\nNow I’m lying in bed, sleep-deprived and emotionally destroyed, trying to decide if I’ll ever be able to look my mother in the eye again. Or if I should tell my wife. Or if I should just disappear.\n\nTL;DR: Left my sex toy on the drying rack. Mom mistook it for a dog toy, filled it with peanut butter, and gave it to my dog.\n\nUpdate/Edit: Just told my wife…….., after almost passing out from laughing so hard, through a smile she scolded me for leaving it in dish rack. Admittedly it wasn’t the first time she has told me to not leave it in there, somehow I think this time the lesson has stuck. Also wow came back to this blowing up hope y’all enjoyed my misery. Edit: Along—> A long\n\nEdit 2: I can’t believe I am answering this right when I wake up. It is not a toy that I insert into me, I insert myself into it (might be a link in the comments) \n\nEdit 3 (hopefully final) Ok wow now my biggest post and first ever awards thank you!! For those who keep asking how my mom knew the name and can’t be bothered to just read the comments “KONG” is a well known dog toy brand, my toy looks similar to it which is why my wife gave it the nickname."
    }
]